// 0. Напишите программу, которая на вход принимает число и
//    выдаёт его квадрат (число умноженное на само себя).

Console.WriteLine("Введите число: ");
int num = int.Parse(Console.ReadLine());
Console.Write("Квадрат числа ");
Console.Write(num);
Console.Write(" равен ");
Console.WriteLine(num * num);